<a href="https://colab.research.google.com/github/Abd-Fattah/Database-Management-and-Practice--IBT3205-/blob/main/Lab%232.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns
import sklearn as skl
import sqlite3

In [10]:
conn = sqlite3.connect('database.sqlite')

In [14]:
conn.execute('''
CREATE TABLE IF NOT EXISTS Company
(ID INT PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
AGE INT NOT NULL,
ADDRESS CHAR(50),
SALARY REAL);
''')

In [15]:
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES (1, 'Paul', 32, 'California', 20000.00)");
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES (2, 'Allen', 25, 'Texas', 15000.00)");
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES (3, 'Teddy', 23, 'Norway', 20000.00)");
conn.execute("INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES (4, 'Mark', 25, 'Rich-Mond', 65000.00)");

In [16]:
conn.commit()

In [18]:
cursor = conn.execute("SELECT ID, NAME, AGE, ADDRESS, SALARY FROM Company")

for row in cursor:
  print("ID = ", row[0])
  print("NAME = ", row[1])
  print("AGE = ", row[2])
  print("ADDRESS = ", row[3])
  print("SALARY = ", row[4], "\n")

conn.close()

ID =  1
NAME =  Paul
AGE =  32
ADDRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Allen
AGE =  25
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
AGE =  23
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
AGE =  25
ADDRESS =  Rich-Mond
SALARY =  65000.0

In [21]:
conn = sqlite3.connect('database.sqlite')

cursor = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")

tables = [table[0] for table in cursor.fetchall()]

print(tables)

['Company']

In [28]:
for i in range(5, 30):
  conn.execute(f"INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES ({i}, 'Person{i}', {20+i}, 'Location{i}', {10000 + i*100});")


conn.commit

IntegrityError: UNIQUE constraint failed: Company.ID

In [29]:
cursor = conn.execute("SELECT ID, NAME, AGE, ADDRESS, SALARY FROM Company")

for row in cursor:
  print("ID = ", row[0])
  print("NAME = ", row[1])
  print("AGE = ", row[2])
  print("ADDRESS = ", row[3])
  print("SALARY = ", row[4], "\n")

ID =  1
NAME =  Paul
AGE =  32
ADDRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Allen
AGE =  25
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
AGE =  23
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
AGE =  25
ADDRESS =  Rich-Mond
SALARY =  65000.0

ID =  5
NAME =  Person5
AGE =  25
ADDRESS =  Location5
SALARY =  10500.0

ID =  6
NAME =  Person6
AGE =  26
ADDRESS =  Location6
SALARY =  10600.0

ID =  7
NAME =  Person7
AGE =  27
ADDRESS =  Location7
SALARY =  10700.0

ID =  8
NAME =  Person8
AGE =  28
ADDRESS =  Location8
SALARY =  10800.0

ID =  9
NAME =  Person9
AGE =  29
ADDRESS =  Location9
SALARY =  10900.0

ID =  10
NAME =  Person10
AGE =  30
ADDRESS =  Location10
SALARY =  11000.0

ID =  11
NAME =  Person11
AGE =  31
ADDRESS =  Location11
SALARY =  11100.0

ID =  12
NAME =  Person12
AGE =  32
ADDRESS =  Location12
SALARY =  11200.0

ID =  13
NAME =  Person13
AGE =  33
ADDRESS =  Location13
SALARY =  11300.0

ID =  14
NAME =  Person14
AGE =  34
ADDRESS =  Location14
SALARY =  11400.0

ID =  15
NAME =  Person15
AGE =  35
ADDRESS =  Location15
SALARY =  11500.0

ID =  16
NAME =  Person16
AGE =  36
ADDRESS =  Location16
SALARY =  11600.0

ID =  17
NAME =  Person17
AGE =  37
ADDRESS =  Location17
SALARY =  11700.0

ID =  18
NAME =  Person18
AGE =  38
ADDRESS =  Location18
SALARY =  11800.0

ID =  19
NAME =  Person19
AGE =  39
ADDRESS =  Location19
SALARY =  11900.0

ID =  20
NAME =  Person20
AGE =  40
ADDRESS =  Location20
SALARY =  12000.0

ID =  21
NAME =  Person21
AGE =  41
ADDRESS =  Location21
SALARY =  12100.0

ID =  22
NAME =  Person22
AGE =  42
ADDRESS =  Location22
SALARY =  12200.0

ID =  23
NAME =  Person23
AGE =  43
ADDRESS =  Location23
SALARY =  12300.0

ID =  24
NAME =  Person24
AGE =  44
ADDRESS =  Location24
SALARY =  12400.0

ID =  25
NAME =  Person25
AGE =  45
ADDRESS =  Location25
SALARY =  12500.0

ID =  26
NAME =  Person26
AGE =  46
ADDRESS =  Location26
SALARY =  12600.0

ID =  27
NAME =  Person27
AGE =  47
ADDRESS =  Location27
SALARY =  12700.0

ID =  28
NAME =  Person28
AGE =  48
ADDRESS =  Location28
SALARY =  12800.0

ID =  29
NAME =  Person29
AGE =  49
ADDRESS =  Location29
SALARY =  12900.0

In [31]:
# Function to connect to database and create table
def create_database_and_table():
    conn = sqlite3.connect('company_database_ver2.db')
    conn.execute('''
    CREATE TABLE IF NOT EXISTS Company
    (ID INT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    AGE INT NOT NULL,
    ADDRESS CHAR(50),
    SALARY REAL);''')
    conn.close()

# Function to insert initial and additional rows
def insert_rows():
    conn = sqlite3.connect('company_database_ver2.db')
    for i in range(1, 25):
        conn.execute(f"INSERT INTO Company (ID, NAME, AGE, ADDRESS, SALARY) VALUES ({i}, 'Person{i}', {20 + i}, 'Location{i}', {10000 + i*100});")
    conn.commit()
    conn.close()

# Function to list tables
def list_tables():
    conn = sqlite3.connect('company_database_ver2.db')
    cursor = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tables = [table[0] for table in cursor.fetchall()]
    print("List of tables in the database:", tables)
    conn.close()

# Function to show all rows from Company Table
def list_rows():
    conn = sqlite3.connect('company_database_ver2.db')
    cursor = conn.execute("SELECT ID, NAME, AGE, ADDRESS, SALARY from Company")
    print("Show all rows from Company Table:")
    for row in cursor:
      print("ID = ", row[0])
      print("NAME = ", row[1])
      print("AGE = ", row[2])
      print("ADDRESS = ", row[3])
      print("SALARY = ", row[4], "\n")


# Create database and table
create_database_and_table()

# Insert initial and additional rows
insert_rows()

# List tables in the database
list_tables()

#show all rows from Company Table
list_rows()

List of tables in the database: ['Company']
Show all rows from Company Table:
ID =  1
NAME =  Person1
AGE =  21
ADDRESS =  Location1
SALARY =  10100.0

ID =  2
NAME =  Person2
AGE =  22
ADDRESS =  Location2
SALARY =  10200.0

ID =  3
NAME =  Person3
AGE =  23
ADDRESS =  Location3
SALARY =  10300.0

ID =  4
NAME =  Person4
AGE =  24
ADDRESS =  Location4
SALARY =  10400.0

ID =  5
NAME =  Person5
AGE =  25
ADDRESS =  Location5
SALARY =  10500.0

ID =  6
NAME =  Person6
AGE =  26
ADDRESS =  Location6
SALARY =  10600.0

ID =  7
NAME =  Person7
AGE =  27
ADDRESS =  Location7
SALARY =  10700.0

ID =  8
NAME =  Person8
AGE =  28
ADDRESS =  Location8
SALARY =  10800.0

ID =  9
NAME =  Person9
AGE =  29
ADDRESS =  Location9
SALARY =  10900.0

ID =  10
NAME =  Person10
AGE =  30
ADDRESS =  Location10
SALARY =  11000.0

ID =  11
NAME =  Person11
AGE =  31
ADDRESS =  Location11
SALARY =  11100.0

ID =  12
NAME =  Person12
AGE =  32
ADDRESS =  Location12
SALARY =  11200.0

ID =  13
NAME =  Person13
AGE =  33
ADDRESS =  Location13
SALARY =  11300.0

ID =  14
NAME =  Person14
AGE =  34
ADDRESS =  Location14
SALARY =  11400.0

ID =  15
NAME =  Person15
AGE =  35
ADDRESS =  Location15
SALARY =  11500.0

ID =  16
NAME =  Person16
AGE =  36
ADDRESS =  Location16
SALARY =  11600.0

ID =  17
NAME =  Person17
AGE =  37
ADDRESS =  Location17
SALARY =  11700.0

ID =  18
NAME =  Person18
AGE =  38
ADDRESS =  Location18
SALARY =  11800.0

ID =  19
NAME =  Person19
AGE =  39
ADDRESS =  Location19
SALARY =  11900.0

ID =  20
NAME =  Person20
AGE =  40
ADDRESS =  Location20
SALARY =  12000.0

ID =  21
NAME =  Person21
AGE =  41
ADDRESS =  Location21
SALARY =  12100.0

ID =  22
NAME =  Person22
AGE =  42
ADDRESS =  Location22
SALARY =  12200.0

ID =  23
NAME =  Person23
AGE =  43
ADDRESS =  Location23
SALARY =  12300.0

ID =  24
NAME =  Person24
AGE =  44
ADDRESS =  Location24
SALARY =  12400.0